//Комментарий
"use strict";
/*
console.log('Hello world');

//пример выражения
let num = 4;                        //выражение численного присвоения
console.log(num);                   //вывод значения в консоль

let phrase = 'Учим JS';             //выражение буквенного присвоения
console.log(phrase);

function name() {
    console.log('Учим');
    console.log('JS');
}
name();

// Java Script является регистрозависимым языком, т.е. имеет важное значение, с какой буквы написано выражение, заглавной, или строчной.
// Пробелы - пробелы принято размечать вокруг операторов для того, чтобы код был читаем.

// Кавычки: В JS можно использовать одинарные, двойные, или обратные кавычки
console.log('Учим JS');             //одинарные
console.log("Учим JS");             //двойные
console.log('Учим JS');             //представим, что обратные

// use strict - строгий режим. Для того, чтобы старый код адекватно работал. Запись обозначается кавычками (двойными, или одинарными) и размещается в начале разметки. Выше может быть только комментарий.
*/